---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ContainsSharedSameNameFamily
source: html/329798e1-d4a4-7e9a-ac8b-25afcf29c88e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ContainsSharedSameNameFamily Property

Family '[Family Name]' contains a shared family of the same name. Please rename one of the two families before loading!

## Syntax (C#)
```csharp
public static FailureDefinitionId ContainsSharedSameNameFamily { get; }
```